---
kind: method
id: M:Autodesk.Revit.DB.Part.GetSourceElementOriginalCategoryIds
source: html/47f225e0-6be6-22fc-8005-4f0e68d95674.htm
---
# Autodesk.Revit.DB.Part.GetSourceElementOriginalCategoryIds Method

Gets the category ids of the source elements which were used to form this part.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetSourceElementOriginalCategoryIds()
```

## Returns
The category ids.